/* Added to PROC_KILLED when the killing signal cause a dump */
" (core dumped)" = " (core dumped)";

/* New Window menu item title format; the variable is the profile name */
"New Window with Profile - %@" = "Uusi ikkuna profiililla - %@";

/* New Tab and contextual menu item title format; the variable is the profile name */
"New Tab with Profile - %@" = "Uusi välilehti profiililla - %@";

/* New Window menu item title format; the variable is the profile name */
"New Window with Same Command" = "Uusi ikkuna samalla komennolla";

/* New Tab menu item title format; the variable is the profile name */
"New Tab with Same Command" = "Uusi välilehti samalla komennolla";

/* Window settings inspector; format string for font field in inspector; argument 1 is the font, argument 2 is the formatted size */
"%1$@ %2$@ pt." = "%1$@ %2$@ pt";

/* Window settings preferences; Keyboard map; format string for Key description column; argument 1 is the modifier, argument 2 is the key */
"%1$@ %2$@" = "%1$@ %2$@";

/* for Undo Menu suffix for settings changes - "Undo Change Setting" */
"Change Setting" = "Muuta asetuksia";

/* Window settings save panel; string combined with full user name for default save name */
"%@\\U2019s profile" = "Profiili (%@)";

/* Default name for new window groups; includes user name */
"%@\\U2019s window group" = "Henkilön %@ ikkunaryhmä";

/* Insert ellipsis into a string truncated in the middle; the variables are the prefix/suffix of the truncated string. */
"%@\\U2026%@" = "%@…%@";

/* Bookmark menu-item title format string; the first parameter is the line number, the second parameter is the bookmark name */
"%@: %@" = "%@: %@";

/* Start of bookmark name; used to find bookmark names in terminal text */
"[" = "[";

/* End of bookmark name; used to find bookmark names in terminal text */
"]" = "]";

/* Separator between permanent and discovered servers */
"--- Discovered Servers ---" = "--- Löydetyt palvelimet ---";

/* Default settings; name for default Black on White settings */
"Black on White" = "Musta valkoisella";

/* Default settings; name for default Black on Yellow settings */
"Black on Yellow" = "Musta keltaisella";

/* Default settings; name for default Blue on White settings */
"Blue on White" = "Sininen valkoisella";

/* Name of built-in default window settings */
"Built-in" = "Sisäinen";

/* No comment provided by engineer. */
"Cancel" = "Kumoa";

/* Menu item title */
"Clear to Previous Bookmark" = "Pyyhi edelliseen kirjanmerkkiin";

/* Menu item title */
"Clear to Previous Mark" = "Pyyhi edelliseen merkkiin";

/* Menu item title */
"Clear to Selected Bookmark" = "Pyyhi valittuun kirjanmerkkiin";

/* Menu item title */
"Clear to Selected Mark" = "Pyyhi valittuun merkkiin";

/* Menu item title */
"Clear to Start of Selection" = "Pyyhi valinnan alkuun";

/* No comment provided by engineer. */
"Close" = "Sulje";

/* No comment provided by engineer. */
"Close All" = "Sulje kaikki";

/* Tab close-button accessibility label/title. */
"Close tab" = "Sulje välilehti";

/* Tab close-button accessibility role description. */
"close tab button" = "sulje välilehti -painike";

/* Tab close sheet; message description for a single process */
"Closing this tab will terminate the running process %@." = "Välilehden sulkeminen lopettaa suoritettavan prosessin %@.";

/* Tab close sheet; message description for multiple processes */
"Closing this tab will terminate the running processes: %@." = "Välilehden sulkeminen lopettaa suoritettavat prosessit: %@.";

/* Used between items concatenated into comma-separated lists. */
", " = ", ";

/* Tab/Window close sheet; process name with duplicate name count */
"%@ (%d)" = "%@ (%d)";

/* Window close sheet; message description for a single process */
"Closing this window will terminate the running process %@." = "Ikkunan sulkeminen lopettaa suoritettavan prosessin %@.";

/* Window close sheet; message description for multiple processes */
"Closing this window will terminate the running processes: %@." = "Ikkunan sulkeminen lopettaa suoritettavat prosessit: %@.";

/* Failure to create a new terminal session. Displayed in terminal content. */
"[Could not create a new process and open a pseudo-tty.]" = "[Uutta prosessia ei voitu luoda eikä näennäispäätettä voitu avata.]";

/* Window settings preferences; text shown with profiles which are set as the default */
"Default" = "Oletus";

/* Window settings preferences; text shown with profiles which are set as the startup profile */
"Startup" = "Aloitus";

/* Compose Email Message contextual menu item. */
"Compose" = "Uusi viesti";

/* SSH/Telnet Connection contextual menu item. */
"Connect" = "Yhdistä";

/* Window settings preferences; text shown with profiles which are set as the Copy Attributes profile */
"Copy" = "Kopiointi";

/* Tab close sheet; message title */
"Do you want to close this tab?" = "Haluatko sulkea tämän välilehden?";

/* Window close sheet; message title */
"Do you want to close this window?" = "Haluatko sulkea tämän ikkunan?";

/* Window close sheet; message title when there are running processes */
"Do you want to terminate running processes in this window?" = "Lopetetaanko tässä ikkunassa suoritettavat prosessit?";

/* Tab close sheet; message title when there are running processes */
"Do you want to terminate running processes in this tab?" = "Lopetetaanko tässä välilehdessä suoritettavat prosessit?";

/* Service */
"File Transfer (ftp)" = "Tiedostonsiirto (ftp)";

/* Find Panel; window title */
"Find" = "Etsi";

/* Default settings; name for default Green on Black settings */
"Green on Black" = "Vihreä mustalla";

/* Shell menu item title; used when inspector is visible */
"Hide Inspector" = "Kätke inspektori";

/* Menu item title */
"Hide Marks" = "Kätke merkit";

/* View Menu item title; used when the tab bar is shown */
"Hide Tab Bar" = "Kätke välilehtipalkki";

/* Application termination dialog; message description */
"If you don\\U2019t review your windows, any running processes will be terminated." = "Jos et tarkista ikkunoita, suoritettavat prosessit lopetetaan.";

/* No comment provided by engineer. */
"It may have been incompletely copied from another machine." = "Se on ehkä kopioitu vain osittain toiselta tietokoneelta.";

/* Window settings import; alert title shown when multiple files are corrupt */
"Multiple files could not be imported." = "Useita tiedostoja ei voitu tuoda.";

/* Default name for new window settings */
"New profile" = "Uusi profiili";

/* No options for this service */
"No options" = "Ei valintoja";

/* Application prefs; string superimposed on table of window groups when none are available */
"No Window Groups Saved" = "Yhtään ikkunaryhmää ei ole tallennettu";

/* Title of menu item used in Open Window Group submenu when no groups are available */
"No Window Groups" = "Ei ikkunaryhmiä";

/* Generic save panel; name of object type used in save panel if not otherwise specified */
"object" = "objekti";

/* No comment provided by engineer. */
"OK" = "OK";

/* Open Link contextual menu item. */
"Open Link" = "Avaa linkki";

/* Open man Page contextual menu item. */
"Open man Page" = "Avaa man-sivu";

/* Help menu item; the variable is the search term. */
"Open man Page for \\U201C%@\\U201D" = "Avaa kohteen ”%@” man-sivu";

/* Open man Page function key label. */
"man page" = "man-sivu";

/* Open man Page function key options label. */
"Search Term Display:" = "Hakutermin näyttö:";

/* Open man Page function key options label. */
"man Title None" = "Ei mitään";

/* Open man Page function key options label. */
"man Title Fixed Width" = "Kiinteä leveys";

/* Open man Page function key options label. */
"man Title Automatic" = "Automaattinen";

/* Help menu item; the variable is the search term. */
"Search man Page Index for \\U201C%@\\U201D" = "Etsi kohdetta ”%@” man-sivuhakemistosta";

/* Message text for invalid Bracketed Paste Mode content alert. */
"You cannot send the text to the terminal, because it contains invalid content for Bracketed Paste Mode." = "Tekstiä ei voida lähettää päätteelle, koska siinä on sisältöä, joka ei ole sallittua ryhmitellyssä sijoitustilassa.";

/* Informative text for invalid Bracketed Paste Mode content alert. */
"Bracketed Paste Mode is enabled in the terminal and the text to send contains the escape sequence that marks the end of pasted text. This is invalid for Bracketed Paste Mode, and could allow subsequent content in the text to perform arbitrary commands." = "Ryhmitelty sijoitustila on käytössä päätteessä ja lähetettävä teksti sisältää merkkiyhdistelmän, joka ilmaisee sijoitettavan tekstin lopun. Tämä ei ole sallittua ryhmitellyssä sijoitustilassa, koska se mahdollistaa merkkiyhdistelmää seuraavan sisällön suorittamisen mielivaltaisena komentona.";

/* Look Up contextual menu item. */
"Look Up" = "Katso lisää";

/* Look Up contextual menu item with truncated text. */
"Look Up \\U201C%@\\U2026\\U201D" = "Katso lisää: %@…";

/* Look Up contextual menu item with selected text. */
"Look Up \\U201C%@\\U201D" = "Katso lisää: %@";

/* Web search (e.g., Google) contextual menu item. */
"Search with %@" = "%@-haku";

/* Web search contextual menu item when the search provider is unknown. */
"Search the Web" = "Etsi verkosta";

/* Default process name */
"Process name" = "Prosessin nimi";

/* No comment provided by engineer. */
"Quit" = "Lopeta";

/* Service */
"Remote Login (telnet)" = "Etäkirjautuminen (telnet)";

/* Window settings preferences; path control pop-up menu item for removing the background image */
"Remove" = "Poista";

/* Generic save panel; title of button used to replace existing object */
"Replace" = "Korvaa";

/* Generic save panel; information text used for alert when replacing existing countable object. */
"Replacing the %@ will override its contents." = "Sisältö korvautuu, jos %@ korvataan.";

/* Generic save panel; information text used for alert when replacing existing uncountable object. */
"Replacing the %@ will override their contents." = "Kohteiden %@ korvaaminen korvaa niiden sisällön.";

/* Application termination dialog; review windows button title */
"Review Windows\\U2026" = "Tarkista ikkunat…";

/* Window group save panel; panel title */
"Save Window Group" = "Tallenna ikkunaryhmä";

/* Service */
"Secure File Transfer (sftp)" = "Suojattu tiedostonsiirto (sftp)";

/* No comment provided by engineer. */
"Secure Shell (ssh)" = "Suoj. etäkirjautuminen (ssh)";

/* Connect to service option */
"SFTP (Automatic)" = "SFTP (automaattinen)";

/* No comment provided by engineer. */
"SFTP Protocol 1" = "SFTP-protokolla 1";

/* Shell menu item title; used when inspector is not visible */
"Show Inspector" = "Näytä inspektori";

/* Menu item title */
"Show Marks" = "Näytä merkit";

/* View Menu item title; used when the tab bar is hidden */
"Show Tab Bar" = "Näytä välilehtipalkki";

/* No comment provided by engineer. */
"SSH (Automatic)" = "SSH (automaattinen)";

/* Connect to service option */
"SSH Protocol 1" = "SSH-protokolla 1";

/* Connect to service option */
"SSH Protocol 2" = "SSH-protokolla 2";

/* Accessibility description for Use Option as Meta Key. */
"use option as meta key" = "käytä optionäppäintä metanäppäimenä";

/* The 'use Option as Meta' title. The word 'Meta' should probably not be localized. */
"⌥ Meta" = "⌥ Meta";

/* The 'use Option as Option key (instead of Meta)' title. */
"⌥ Option" = "⌥ optio";

/* Displayed to indicate that the Option modifier key is currently mapped to the Meta modifier. Like the word 'Meta' this should probably not be localized. */
"M" = "M";

/* Displayed to indicate that the Option modifier key is currently mapped to the Meta modifier. The word 'Meta' should probably not be localized. */
"Option is Meta" = "Optio on meta";

/* Displayed to indicate that the Option modifier key is NOT currently mapped to the Meta modifier. */
"\\U2325" = "⌥";

/* Displayed to indicate that the Option modifier key is NOT currently mapped to the Meta modifier. */
"Option" = "Optio";

/* Accessibility description for Insert Bookmark. */
"insert bookmark" = "lisää kirjanmerkki";

/* Accessibility description for Jump/Select to Next Mark. */
"next mark" = "seuraava merkki";

/* Accessibility description for Jump/Select to Previous Mark. */
"previous mark" = "edellinen merkki";

/* Accessibility description for Jump/Select to Next Bookmark. */
"next bookmark" = "seuraava kirjanmerkki";

/* Accessibility description for Jump/Select to Previous Bookmark. */
"previous bookmark" = "edellinen kirjanmerkki";

/* Function key description */
"Previous/Next Mark" = "Edellinen/seuraava merkki";

/* Function key description */
"Previous/Next Bookmark" = "Edellinen/seuraava kirjanmerkki";

/* Function key description */
"Previous/Next Mark — Insert Bookmark" = "Edellinen/seuraava merkki — Lisää kirjanmerkki";

/* Button title for making a new tab. */
"New Tab" = "Uusi välilehti";

/* Accessibility description for New Remote Connection. */
"new remote connection" = "uusi etäyhteys";

/* Function key description */
"New Remote Connection" = "Uusi etäyhteys";

/* Button title for inserting a new bookmark. */
"Insert Bookmark" = "Lisää kirjanmerkki";

/* Terminal title component; enables adding markup around each of the title components, before they are concatenated with em-dashes between them */
"terminal title component" = "%@";

/* default title */
"Terminal" = "Pääte";

/* Default name for Save Text As... menu */
"Terminal Saved Output.txt" = "Päätteen tallennettu tuloste.txt";

/* No comment provided by engineer. */
"Terminate" = "Lopeta";

/* Application termination dialog; terminate processes button title */
"Terminate Processes" = "Lopeta prosessit";

/* Generic save panel; title used for alert when replacing existing uncountable object. */
"The %1$@ %2$@ already exist. Do you want to replace them?" = "%1$@ %2$@ ovat jo olemassa. Haluatko korvata ne?";

/* Generic save panel; title used for alert when replacing existing countable object. */
"The %1$@ %2$@ already exists. Do you want to replace it?" = "%1$@ %2$@ on jo olemassa. Haluatko korvata sen?";

/* No comment provided by engineer. */
"The administrator has set your shell to an illegal value." = "Ylläpitäjä on asettanut komentotulkiksi virheellisen vaihtoehdon.";

/* Window settings import; alert description shown when a single file is corrupt */
"The file is corrupt. You may be able to obtain a fresh copy of the file from its author." = "Tiedosto on vahingoittunut. Voit saada toimivan tiedoston sen tekijältä.";

/* No comment provided by engineer. */
"The file \\U201C%@\\U201D could not be executed because you do not have appropriate access privileges." = "Tiedostoa ”%@” ei voitu suorittaa, koska tarvittavat käyttöoikeudet puuttuvat.";

/* Window settings import; alert title shown when a single file is corrupt; %@ is filename */
"The file \\U201C%@\\U201D could not be imported." = "Tiedostoa ”%@” ei voitu tuoda.";

/* No comment provided by engineer. */
"The file \\U201C%@\\U201D could not be opened because it is corrupt." = "Tiedostoa ”%@” ei voitu avata, koska se on vioittunut.";

/* Window settings import; alert description shown when a multiple files are corrupt; %@ is comma-separated list of filenames */
"The following files are corrupt: %@. You may be able to obtain a fresh copy of the files from their author." = "Seuraavat tiedostot ovat vahingoittuneet: %@. Voit saada toimivat tiedostot niiden tekijöiltä.";

/* Window settings; error title when settings name is empty */
"The name is too short." = "Nimi on liian lyhyt.";

/* Window settings; error title when settings name is already in use */
"A profile named \\U201C%@\\U201D already exists." = "Profiili ”%@” on jo olemassa.";

/* No comment provided by engineer. */
"To view or change access privileges, select the file in the Finder and choose File > Get Info." = "Jos haluat tarkastella tai muuttaa käyttöoikeuksia, valitse tiedosto Finderissa ja valitse Arkisto > Näytä tietoja.";

/* Window settings; error description when settings name is already in use or is reserved */
"Try entering a different name." = "Syötä toinen nimi.";

/* Window settings; error description when settings name is empty */
"Try entering a name with more characters." = "Syötä nimi, jossa on enemmän merkkejä.";

/* Function key description */
"Use Option as Meta Key" = "Käytä optionäppäintä metanäppäimenä";

/* Accessibility description for Open man Page for Selection. */
"open man page" = "avaa man-sivu";

/* Function key description */
"Open man Page for Selection" = "Avaa valinnan man-sivu";

/* Function key description */
"Background Color" = "Taustaväri";

/* Function keys description */
"VT100 (PF1-PF4)" = "VT100 (PF1–PF4)";

/* Function keys description */
"VT220 (PF1-PF4 + F5-F20)" = "VT220 (PF1–PF4 + F5–F20)";

/* Function keys description */
"VT220 Extras (F13-F20)" = "VT220 – ekstrat (F13–F20)";

/* Function keys description */
"VT220 Compact (F1-F20)" = "VT220 – kompakti (F1–F20)";

/* Function keys description */
"VT420 All Enabled (PF1-PF4 + F1-F20)" = "VT420 – kaikki käytössä (PF1–PF4 + F1–F20)";

/* No comment provided by engineer. */
"w" = "w";

/* Default settings; name for default White on Black settings */
"White on Black" = "Valkoinen mustalla";

/* Default settings; name for default White on Blue settings */
"White on Blue" = "Valkoinen sinisellä";

/* Window group save panel; name of object used in replacement panels */
"window group" = "ikkunaryhmä";

/* Window settings save panel; name of object used in replacement panels */
"profile" = "profiili";

/* No comment provided by engineer. */
"You are not authorized to run this application." = "Sinulla ei ole oikeuksia suorittaa tätä ohjelmaa.";

/* Application termination dialog; message title */
"You have %d windows with running processes. Do you want to review these windows before quitting?" = "%d ikkunassa on suoritettavia prosesseja. Haluatko tarkistaa ikkunat ennen lopettamista?";

/* Appears in window when the user's custom command/shell isn't found. */
"[Command not found: %@]" = "[Komentoa ei löytynyt: %@]";

/* Appears in window when the shell exits cleanly */
"[Process completed]" = "[Prosessi valmis]";

/* Appears in window when the shell exits abnormally */
"[Process exited - exit code %u]" = "[Prosessi lopetti - lopetuskoodi %u]";

/* Appears in window when the shell is murdered */
"[Process was terminated by signal %d%s]" = "[Prosessi päättyi signaaliin %1$d%2$s]";

/* Appears at the start of restored terminal text when truncated */
"[Restored contents truncated]" = "[Palautettu sisältö typistetty]";

/* Appears at the end of restored terminal text; the parameter is a date/time string */
"[Restored %@]" = "[Palautettu %@]";

/* User-inserted bookmark; the parameter is the bookmark name */
"[%@]" = "[%@]";

/* User-inserted bookmark default name; the parameter is a date/time string */
"Bookmarked %@" = "Kirjanmerkki %@";

/* Bookmarks menu item title for when there are no bookmarks */
"No Bookmarks" = "Ei kirjanmerkkejä";

/* Separator used for dimensions in window title */
"\\U00D7" = "×";

/* Thin-space and ellipses suffixed to process name to indicate activity in terminal */
"%@\\U2009\\U2026" = "%@ …";

/* Ellipses to indicate unread output in terminal */
"\\U2026" = "…";

/* strings used for split view controls */

"Split view" = "Jaettu näkymä";

"Close split-view" = "Sulje jaettu näkymä";

/* strings used for Shortcut man page support */

"Man Pages" = "Man-sivut";

/* denied request from quarantined/sandboxed application to open file */
"\\U201C%@\\U201D can\\U2019t be opened because %@ is not allowed to open documents in Terminal." = "%@ ei ole avattavissa, koska ohjelmalla %@ ei ole lupaa avata dokumentteja Päätteessä.";

/* strings used for quarantine alerts */

"QuarantineTitleSSH" = "Pääte avaa ssh-yhteyden kohteeseen %@ ohjelmalle %@.";
"QuarantineTitleTelnet" = "Pääte avaa telnet-yhteyden kohteeseen %@ ohjelmalle %@.";
"QuarantineTitle2" = " Sallitaanko tämä?";
"QuarantineMessage" = "Tämä paljastaa käyttäjätunnuksesi ja verkko-osoitteesi toiselle tietokoneelle. Vältät varoitukset tulevaisuudessa lisäämällä sen tunnettujen palvelimien ssh-luetteloon.";
"QuarantineMessageError" = "\n\nVirhe etsittäessä tunnettuja palvelimia (suorita ”%@”, jos haluat lisätietoja).";
"QuarantineAllow" = "Salli";
"QuarantineDeny" = "Älä salli";

"Alter Profiles" = "Muokkaa profiileita";

/* Inspector process list: separator between process name annotations (middle dot between thin spaces) */
"\\U2009\\U00B7\\U2009" = " · ";

/* Inspector process list: process name status annotation */
"(stopped)" = "(pysäytetty)";

/* Inspector process list: process name status annotation */
"(zombie)" = "(zombi)";

/* Inspector process list: process status */
"Idle" = "Vapaa";

/* Inspector process list: process status */
"Runnable" = "Suoritettava";

/* Inspector process list: process status */
"Sleeping" = "Siirrytään nukkumaan";

/* Inspector process list: process status */
"Stopped" = "Pysäytetty";

/* Inspector process list: process status */
"Zombie" = "Zombi";

/* Inspector process list: boolean YES */
"Yes" = "Kyllä";

/* Inspector process list: boolean NO */
"No" = "Ei";
